
  #### plan-nodes-20251103T124126.txt 📖: `success`
  <details><summary>Show Contents</summary>

  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.tiles-test.onepassword_item.kubeconfig[0] will be created
  + resource "onepassword_item" "kubeconfig" {
      + category   = "secure_note"
      + id         = (known after apply)
      + note_value = (sensitive value)
      + password   = (sensitive value)
      + title      = "tiles-test-kubeconfig"
      + uuid       = (known after apply)
      + vault      = "lyyqeg3pe6dvqdeb5hbiu7b76y"
    }

  # module.tiles-test.talos_cluster_kubeconfig.this[0] will be created
  + resource "talos_cluster_kubeconfig" "this" {
      + certificate_renewal_duration    = "720h"
      + client_configuration            = {
          + ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBajZrNG4yQVBOVklRNVJlL3VEMklnakFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXhNREkwTWpJME1EUTFXaGNOTXpVeE1ESXlNakkwTURRMVdqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQURkVTVVbGVMQzNFcWhtS2pVcHhtY1QvTXFLNG5Cb200TDYzCjFRbkVseDNSbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRkl1VnRkaGpVSEtucitBMApzM0w5amc2eFBXR0FNQVVHQXl0bGNBTkJBQjlIbVYyaHhja0k1b29LSGN0ZUYzMGxrZmZMcHV3cUFJcjFzWHRWCnQ4NFpkMGpkalh2emdBblN5WmZMdXkwQTZPa0x1cHBQVnN3cnhuaU9YaDVSVWdRPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
          + client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLVENCM0tBREFnRUNBaEVBeE95U0pHeTN5VHBFbmszcDJUZkVGVEFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXhNREkwTWpJME1EUTFXaGNOTWpZeE1ESTBNakkwTURRMVdqQVRNUkV3RHdZRApWUVFLRXdodmN6cGhaRzFwYmpBcU1BVUdBeXRsY0FNaEFPenZEZDBaaFg4ODJ5U2k4TXp1MlNRN0dRMlNQMzRECnZPaWNDRjZubUlGWW8wZ3dSakFPQmdOVkhROEJBZjhFQkFNQ0I0QXdFd1lEVlIwbEJBd3dDZ1lJS3dZQkJRVUgKQXdJd0h3WURWUjBqQkJnd0ZvQVVpNVcxMkdOUWNxZXY0RFN6Y3YyT0RyRTlZWUF3QlFZREsyVndBMEVBcHlzVwpsSkJIaGMvcWdQbVN5MXlCYUZzYlBPK3kvWU5uYldwQ1AyU1NKcGJUdlh2U2V2TStLczVOWTZBQ1MyUnJQZHpLCnNsbStJRlEvdFB4aGI3SGRCdz09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
          + client_key         = (sensitive value)
        }
      + endpoint                        = "10.0.105.32"
      + id                              = (known after apply)
      + kubeconfig_raw                  = (sensitive value)
      + kubernetes_client_configuration = (known after apply)
      + node                            = "10.0.105.32"
    }

  # module.tiles-test.talos_machine_bootstrap.this[0] will be created
  + resource "talos_machine_bootstrap" "this" {
      + client_configuration = {
          + ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQekNCOHFBREFnRUNBaEVBajZrNG4yQVBOVklRNVJlL3VEMklnakFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXhNREkwTWpJME1EUTFXaGNOTXpVeE1ESXlNakkwTURRMVdqQVFNUTR3REFZRApWUVFLRXdWMFlXeHZjekFxTUFVR0F5dGxjQU1oQURkVTVVbGVMQzNFcWhtS2pVcHhtY1QvTXFLNG5Cb200TDYzCjFRbkVseDNSbzJFd1h6QU9CZ05WSFE4QkFmOEVCQU1DQW9Rd0hRWURWUjBsQkJZd0ZBWUlLd1lCQlFVSEF3RUcKQ0NzR0FRVUZCd01DTUE4R0ExVWRFd0VCL3dRRk1BTUJBZjh3SFFZRFZSME9CQllFRkl1VnRkaGpVSEtucitBMApzM0w5amc2eFBXR0FNQVVHQXl0bGNBTkJBQjlIbVYyaHhja0k1b29LSGN0ZUYzMGxrZmZMcHV3cUFJcjFzWHRWCnQ4NFpkMGpkalh2emdBblN5WmZMdXkwQTZPa0x1cHBQVnN3cnhuaU9YaDVSVWdRPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
          + client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLVENCM0tBREFnRUNBaEVBeE95U0pHeTN5VHBFbmszcDJUZkVGVEFGQmdNclpYQXdFREVPTUF3R0ExVUUKQ2hNRmRHRnNiM013SGhjTk1qVXhNREkwTWpJME1EUTFXaGNOTWpZeE1ESTBNakkwTURRMVdqQVRNUkV3RHdZRApWUVFLRXdodmN6cGhaRzFwYmpBcU1BVUdBeXRsY0FNaEFPenZEZDBaaFg4ODJ5U2k4TXp1MlNRN0dRMlNQMzRECnZPaWNDRjZubUlGWW8wZ3dSakFPQmdOVkhROEJBZjhFQkFNQ0I0QXdFd1lEVlIwbEJBd3dDZ1lJS3dZQkJRVUgKQXdJd0h3WURWUjBqQkJnd0ZvQVVpNVcxMkdOUWNxZXY0RFN6Y3YyT0RyRTlZWUF3QlFZREsyVndBMEVBcHlzVwpsSkJIaGMvcWdQbVN5MXlCYUZzYlBPK3kvWU5uYldwQ1AyU1NKcGJUdlh2U2V2TStLczVOWTZBQ1MyUnJQZHpLCnNsbStJRlEvdFB4aGI3SGRCdz09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
          + client_key         = (sensitive value)
        }
      + endpoint             = "10.0.105.32"
      + id                   = (known after apply)
      + node                 = "10.0.105.32"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - test_bootstrap_node        = "10.0.105.32" -> null
  - test_cluster_endpoint      = "https://10.0.105.10:6443" -> null
  - test_control_plane_config  = (sensitive value) -> null
  - test_control_plane_ips     = [
      - "10.0.105.32",
    ] -> null
  - test_control_plane_vip     = "10.0.105.10" -> null
  - test_machine_secrets       = (sensitive value) -> null
  - test_talosconfig           = (sensitive value) -> null
  - test_vms_started           = true -> null
  - test_worker_config         = (sensitive value) -> null
  - tiles_cluster_endpoint     = "https://10.0.101.10:6443" -> null
  - tiles_control_plane_config = (sensitive value) -> null
  - tiles_control_plane_ips    = [
      - "10.0.101.21",
      - "10.0.101.22",
      - "10.0.101.31",
    ] -> null
  - tiles_control_plane_vip    = "10.0.101.10" -> null
  - tiles_talosconfig          = (sensitive value) -> null
  - tiles_vms_started          = false -> null
  - tiles_worker_config        = (sensitive value) -> null

  ```

  </details>
  
  